* Aventure en court

#+NAME: aventure
| Aventure                 | Acte | Scène | Fichier                      | Courante |
|--------------------------+------+-------+------------------------------+----------|
| Le pistolet sur la tempe |    1 |     1 | le_pistolet_sur_la_tempe.org |        1 |

#+begin_src sqlite :db ac2d20.db :var orgtable=aventure :colnames yes
drop table if exists aventure;
create table aventure(Aventure text, Scène tinyint);
.mode csv aventure
.import $orgtable aventure
#+end_src

#+RESULTS:

#+NAME: points
| Nom    | Valeurs |
|--------+---------|
| Menace |      10 |
| Élan   |       0 |
#+begin_src sqlite :db ac2d20.db :var orgtable=points :colnames yes
drop table if exists points;
create table points(Nom text, Valeur tinyint);
.mode csv points
.import $orgtable points
#+end_src

#+RESULTS:



* Stress et Blessures

#+NAME: stress
| Personnage | Stress | Fatigue | StressMax | StressRestant | Blessures | BlessuresMax | BlessuresRestantes | État | Fortune |
|------------+--------+---------+-----------+---------------+-----------+--------------+--------------------+------+---------|
| asha       |      0 |       0 |        10 |            10 |         0 |            3 |                  3 |      |       3 |
| igor       |      0 |       0 |        14 |            14 |         0 |            3 |                  3 |      |       3 |
| jean       |      0 |       0 |        11 |            11 |         0 |            3 |                  3 |      |       3 |
| renato     |      0 |       0 |         9 |             9 |         0 |            3 |                  3 |      |       3 |
| émile      |      0 |       0 |        13 |            13 |         0 |            3 |                  3 |      |       3 |
#+TBLFM: $5=$4-$3-$2::$8=$7-$6

#+begin_src sqlite :db ac2d20.db :var orgtable=stress :colnames yes
drop table if exists stress;
create table stress(Personnage text, Stress tinyint, Fatique tinyint, StressMax tinyint, StressRestant tinyint, Blessure tinyint, BlessuresMax tinyint, BlessuresRestantes tinyint, État text, Fortune tinyint);
.mode csv stress
.import $orgtable stress
#+end_src

#+RESULTS:;


* Caractéristiques
  
#+NAME: caractéristiques
| Personnage | Agilité | Coordination | Perspicacité | Raison | Vigueur | Volonté |
|------------+---------+--------------+--------------+--------+---------+---------|
| asha       | 11 (+2) | 9 (+1)       |            8 |      7 |       8 |       8 |

#+begin_src sqlite :db ac2d20.db :var orgtable=caractéristiques :colnames yes
drop table if exists caractéristiques;
create table caractéristiques(Personnage text, Agilité tinyint, Coordination tinyint, Perspicacité tinyint, Raison tinyint, Vigueur tinyint, Volonté tinyint);
.mode csv 
.import $orgtable caractéristiques
#+end_src

#+RESULTS:




* Compétences

#+NAME: compétences
| Personnage | Compétence  |                            Valeur |
|------------+-------------+-----------------------------------|
| asha       | Athlétisme  |                                 3 |
| asha       | Ingénieurie |                                 1 |
| asha       | Combat      |                 2, Armes de mêlée |
| asha       | Observation |                                 1 |
| asha       | Persuasion  |                                 1 |
| asha       | Résilience  |                                 2 |
| asha       | Discrétion  | 5, Camouflage, Discrétion Urbaine |
| asha       | Survie      |                                 1 |
| asha       | Tactiques   |            1, Opérations Secrètes |
|            |             |                                   |
#+begin_src sqlite :db ac2d20.db :var orgtable=compétences :colnames yes
drop table if exists compétences;
create table compétences(Personnage text, Compétence VARCHAR(64), Valeur VARCHAR(256));
.mode csv 
.import $orgtable compétences
#+end_src

#+RESULTS:



* Équipement

#+NAME: armes
| Arme      | Nom                 | Focus | Portée | Dommages     | Salve | Taille | Qualités |
|-----------+---------------------+-------+--------+--------------+-------+--------+----------|
| coutranch | Couteau de tranchée | Mêlée | Proche | 3dd, Vicieux |       | Mineur | Caché    |
#+begin_src sqlite :db ac2d20.db :var orgtable=armes :colnames yes
drop table if exists armes;
create table armes(Arme VARCHAR(32), Nom VARCHAR(256), Focus VARCHAR(256), Portée VARCHAR(32), Dommages VARCHAR(256), Salve VARCHAR(256), Taille VARCHAR(32), Qualités VARCHAR(256));
.mode csv 
.import $orgtable armes
#+end_src

#+RESULTS:


#+NAME: équipement
| Personnage | Arme      | Munitions |
|------------+-----------+-----------|
| asha       | coutranch |           |

#+begin_src sqlite :db ac2d20.db :var orgtable=équipement :colnames yes
drop table if exists équipement;
create table équipement(Personnage text, Arme VARCHAR(32), Munitions TINYINT);
.mode csv 
.import $orgtable équipement
#+end_src

#+RESULTS:

